---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidElevationSketchError
source: html/08a79fc1-e433-a7ef-79f2-71fd8edd91f2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidElevationSketchError Property

Elevation Profile sketch is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidElevationSketchError { get; }
```